{
  "irVersion": "1",
  "exportedAt": 1784673011419,
  "excludes": [
    "test-apps",
    "docs/evidence",
    "packages/core/test/fixtures",
    "packages/plugin-typescript/test/fixtures",
    "packages/cli/test/fixtures",
    "packages/agent/test/fixtures"
  ],
  "ruleset": {
    "irVersion": "1",
    "components": {
      "core": {
        "name": "core",
        "selector": {
          "kind": "glob",
          "patterns": [
            "packages/core/**"
          ]
        },
        "empty": "fail"
      },
      "pluginTypescript": {
        "name": "pluginTypescript",
        "selector": {
          "kind": "glob",
          "patterns": [
            "packages/plugin-typescript/**"
          ]
        },
        "empty": "fail"
      },
      "cli": {
        "name": "cli",
        "selector": {
          "kind": "glob",
          "patterns": [
            "packages/cli/**"
          ]
        },
        "empty": "fail"
      },
      "agent": {
        "name": "agent",
        "selector": {
          "kind": "glob",
          "patterns": [
            "packages/agent/**"
          ]
        },
        "empty": "fail"
      },
      "createAlign": {
        "name": "createAlign",
        "selector": {
          "kind": "glob",
          "patterns": [
            "packages/create-align/**"
          ]
        },
        "empty": "fail"
      }
    },
    "rules": [
      {
        "kind": "arch.no-cycles",
        "id": "arch.no-cycles:repo",
        "scope": "repo",
        "includeTypeOnly": false,
        "provenance": {
          "because": "Enforced by docs/ARCHITECTURE-RULES.md:14: '{\"kind\":\"arch.no-cycles\",\"scope\":\"repo\"}'",
          "sourceFile": "docs/ARCHITECTURE-RULES.md",
          "sourceLineRange": {
            "startLine": 14,
            "endLine": 14
          },
          "sourceQuote": "{\"kind\":\"arch.no-cycles\",\"scope\":\"repo\"}"
        }
      },
      {
        "kind": "arch.no-dependency",
        "id": "arch.no-dependency:core->pluginTypescript",
        "from": "core",
        "to": "pluginTypescript",
        "provenance": {
          "because": "@spikedpunch/align-core has zero framework dependencies (zod only) so it stays importable by a future non-Node/non-TS consumer without dragging a compiler along — plugin-typescript, cli, and agent implement its interfaces, never the reverse (ARCHITECTURE.md §5). The node:child_process arm is ADR 017 Part A's dogfood migration: core has no legitimate shell-out need, so this is a fully portable replacement for the corresponding slice of the no-child-process-outside-git-rails custom.host predicate below (survives `align check --untrusted`, unlike that predicate). Enforced by docs/ARCHITECTURE-RULES.md:19: '- **Rule**: `core` must not depend on `pluginTypescript`.'",
          "sourceFile": "docs/ARCHITECTURE-RULES.md",
          "sourceLineRange": {
            "startLine": 19,
            "endLine": 19
          },
          "sourceQuote": "- **Rule**: `core` must not depend on `pluginTypescript`."
        }
      },
      {
        "kind": "arch.no-dependency",
        "id": "arch.no-dependency:core->cli",
        "from": "core",
        "to": "cli",
        "provenance": {
          "because": "@spikedpunch/align-core has zero framework dependencies (zod only) so it stays importable by a future non-Node/non-TS consumer without dragging a compiler along — plugin-typescript, cli, and agent implement its interfaces, never the reverse (ARCHITECTURE.md §5). The node:child_process arm is ADR 017 Part A's dogfood migration: core has no legitimate shell-out need, so this is a fully portable replacement for the corresponding slice of the no-child-process-outside-git-rails custom.host predicate below (survives `align check --untrusted`, unlike that predicate). Enforced by docs/ARCHITECTURE-RULES.md:23: '- **Rule**: `core` must not depend on `cli`.'",
          "sourceFile": "docs/ARCHITECTURE-RULES.md",
          "sourceLineRange": {
            "startLine": 23,
            "endLine": 23
          },
          "sourceQuote": "- **Rule**: `core` must not depend on `cli`."
        }
      },
      {
        "kind": "arch.metric",
        "id": "arch.metric:loc:cli",
        "target": "cli",
        "metric": "loc",
        "max": 500,
        "provenance": {
          "because": "Enforced by docs/ARCHITECTURE-RULES.md:36: '- **Rule**: files in `cli` must stay under 500 lines.'",
          "sourceFile": "docs/ARCHITECTURE-RULES.md",
          "sourceLineRange": {
            "startLine": 36,
            "endLine": 36
          },
          "sourceQuote": "- **Rule**: files in `cli` must stay under 500 lines."
        }
      },
      {
        "kind": "arch.no-dependency",
        "id": "arch.no-dependency:core->agent",
        "from": "core",
        "to": "agent",
        "provenance": {
          "because": "@spikedpunch/align-core has zero framework dependencies (zod only) so it stays importable by a future non-Node/non-TS consumer without dragging a compiler along — plugin-typescript, cli, and agent implement its interfaces, never the reverse (ARCHITECTURE.md §5). The node:child_process arm is ADR 017 Part A's dogfood migration: core has no legitimate shell-out need, so this is a fully portable replacement for the corresponding slice of the no-child-process-outside-git-rails custom.host predicate below (survives `align check --untrusted`, unlike that predicate)."
        }
      },
      {
        "kind": "arch.no-dependency",
        "id": "arch.no-dependency:core->external:node:child_process",
        "from": "core",
        "to": {
          "kind": "external",
          "pattern": "node:child_process",
          "includeTypeOnly": false
        },
        "provenance": {
          "because": "@spikedpunch/align-core has zero framework dependencies (zod only) so it stays importable by a future non-Node/non-TS consumer without dragging a compiler along — plugin-typescript, cli, and agent implement its interfaces, never the reverse (ARCHITECTURE.md §5). The node:child_process arm is ADR 017 Part A's dogfood migration: core has no legitimate shell-out need, so this is a fully portable replacement for the corresponding slice of the no-child-process-outside-git-rails custom.host predicate below (survives `align check --untrusted`, unlike that predicate)."
        }
      },
      {
        "kind": "arch.no-dependency",
        "id": "arch.no-dependency:pluginTypescript->external:node:child_process",
        "from": "pluginTypescript",
        "to": {
          "kind": "external",
          "pattern": "node:child_process",
          "includeTypeOnly": false
        },
        "provenance": {
          "because": "ADR 017 Part A dogfood migration: plugin-typescript (the TS scanner) has no legitimate child_process need — a portable replacement for the corresponding slice of no-child-process-outside-git-rails."
        }
      },
      {
        "kind": "arch.layers",
        "id": "arch.layers:cli",
        "layers": [
          {
            "layer": "cli",
            "canDependOn": [
              "core",
              "pluginTypescript",
              "agent"
            ]
          }
        ],
        "provenance": {
          "because": "cli is the composition root — the only package that imports a concrete LanguagePlugin/FixProvider and wires it together (ARCHITECTURE.md §5)."
        }
      },
      {
        "kind": "arch.no-dependency",
        "id": "arch.no-dependency:cli->external:node:child_process",
        "from": "cli",
        "to": {
          "kind": "external",
          "pattern": "node:child_process",
          "includeTypeOnly": false
        },
        "provenance": {
          "because": "ADR 017 Part A dogfood migration: the CLI composition root has zero legitimate child_process need today — a portable replacement for the corresponding slice of no-child-process-outside-git-rails."
        }
      },
      {
        "kind": "arch.layers",
        "id": "arch.layers:agent",
        "layers": [
          {
            "layer": "agent",
            "canDependOn": [
              "core"
            ]
          }
        ],
        "provenance": {
          "because": "@spikedpunch/align-agent (Stage 4 BYOK fix loop, ADR 010) depends only on @spikedpunch/align-core + @anthropic-ai/sdk — it never imports plugin-typescript or cli; the CLI composition root wires concrete effects (git, fs, the TS scanner) into it, not the reverse (IMPLEMENTATION_PLAN.md Stage 4)."
        }
      },
      {
        "kind": "arch.no-dependency",
        "id": "arch.no-dependency:core->createAlign",
        "from": "core",
        "to": "createAlign",
        "provenance": {
          "because": "@spikedpunch/create-align (`pnpm create @spikedpunch/align`) bootstraps align into a target repo by shelling out to the package manager and the freshly-installed align binary — it imports nothing from core/plugin-typescript/cli/agent, and nothing in this repo imports it back, a true leaf package (rule of three: install logic lives only here, scaffolding logic only in cli/init)."
        }
      },
      {
        "kind": "arch.no-dependency",
        "id": "arch.no-dependency:createAlign->core",
        "from": "createAlign",
        "to": "core",
        "provenance": {
          "because": "@spikedpunch/create-align (`pnpm create @spikedpunch/align`) bootstraps align into a target repo by shelling out to the package manager and the freshly-installed align binary — it imports nothing from core/plugin-typescript/cli/agent, and nothing in this repo imports it back, a true leaf package (rule of three: install logic lives only here, scaffolding logic only in cli/init)."
        }
      },
      {
        "kind": "arch.no-dependency",
        "id": "arch.no-dependency:pluginTypescript->createAlign",
        "from": "pluginTypescript",
        "to": "createAlign",
        "provenance": {
          "because": "@spikedpunch/create-align (`pnpm create @spikedpunch/align`) bootstraps align into a target repo by shelling out to the package manager and the freshly-installed align binary — it imports nothing from core/plugin-typescript/cli/agent, and nothing in this repo imports it back, a true leaf package (rule of three: install logic lives only here, scaffolding logic only in cli/init)."
        }
      },
      {
        "kind": "arch.no-dependency",
        "id": "arch.no-dependency:createAlign->pluginTypescript",
        "from": "createAlign",
        "to": "pluginTypescript",
        "provenance": {
          "because": "@spikedpunch/create-align (`pnpm create @spikedpunch/align`) bootstraps align into a target repo by shelling out to the package manager and the freshly-installed align binary — it imports nothing from core/plugin-typescript/cli/agent, and nothing in this repo imports it back, a true leaf package (rule of three: install logic lives only here, scaffolding logic only in cli/init)."
        }
      },
      {
        "kind": "arch.no-dependency",
        "id": "arch.no-dependency:cli->createAlign",
        "from": "cli",
        "to": "createAlign",
        "provenance": {
          "because": "@spikedpunch/create-align (`pnpm create @spikedpunch/align`) bootstraps align into a target repo by shelling out to the package manager and the freshly-installed align binary — it imports nothing from core/plugin-typescript/cli/agent, and nothing in this repo imports it back, a true leaf package (rule of three: install logic lives only here, scaffolding logic only in cli/init)."
        }
      },
      {
        "kind": "arch.no-dependency",
        "id": "arch.no-dependency:createAlign->cli",
        "from": "createAlign",
        "to": "cli",
        "provenance": {
          "because": "@spikedpunch/create-align (`pnpm create @spikedpunch/align`) bootstraps align into a target repo by shelling out to the package manager and the freshly-installed align binary — it imports nothing from core/plugin-typescript/cli/agent, and nothing in this repo imports it back, a true leaf package (rule of three: install logic lives only here, scaffolding logic only in cli/init)."
        }
      },
      {
        "kind": "arch.no-dependency",
        "id": "arch.no-dependency:agent->createAlign",
        "from": "agent",
        "to": "createAlign",
        "provenance": {
          "because": "@spikedpunch/create-align (`pnpm create @spikedpunch/align`) bootstraps align into a target repo by shelling out to the package manager and the freshly-installed align binary — it imports nothing from core/plugin-typescript/cli/agent, and nothing in this repo imports it back, a true leaf package (rule of three: install logic lives only here, scaffolding logic only in cli/init)."
        }
      },
      {
        "kind": "arch.no-dependency",
        "id": "arch.no-dependency:createAlign->agent",
        "from": "createAlign",
        "to": "agent",
        "provenance": {
          "because": "@spikedpunch/create-align (`pnpm create @spikedpunch/align`) bootstraps align into a target repo by shelling out to the package manager and the freshly-installed align binary — it imports nothing from core/plugin-typescript/cli/agent, and nothing in this repo imports it back, a true leaf package (rule of three: install logic lives only here, scaffolding logic only in cli/init)."
        }
      },
      {
        "kind": "custom.host",
        "id": "custom.host:typesLayerIsLeaf",
        "hostRuleName": "typesLayerIsLeaf",
        "portable": false,
        "provenance": {
          "because": "packages/core/src/types/ is align's foundation layer (branded types, IR zod schema, Violation model) and must not acquire a dependency on any sibling subdirectory of packages/core/src/ — a sub-path-scoped invariant arch.layers/arch.no-dependency can't express at core's whole-component granularity (docs/proposals/rule-expansion-evaluation.md §A.2.2). Predicate registered in this file's hostRules export."
        }
      },
      {
        "kind": "custom.host",
        "id": "custom.host:no-child-process-outside-git-rails",
        "hostRuleName": "no-child-process-outside-git-rails",
        "portable": false,
        "provenance": {
          "because": "node:child_process shell-outs in agent/createAlign PRODUCTION code must stay confined to the audited, execFile-only rails (packages/agent/src/git.ts, packages/agent/src/format.ts, packages/create-align/src/nodeEffects.ts) — everywhere else in those two components, a child_process import is an unaudited shell-injection/supply-chain surface (test files are exempt; e2e-git.test.ts has a legitimate, reviewed test-time shell-out). core/pluginTypescript/cli are now covered by the three portable cannotDependOn(external('node:child_process')) rules above instead (ADR 017 Part A, 2026-07-21 migration) — this predicate is narrowed to the two components with a genuine file-level exemption arch.no-dependency/arch.layers cannot express at whole-component grain (docs/proposals/rule-expansion-evaluation.md §A.2.2, same gap typesLayerIsLeaf documents). Predicate registered in this file's hostRules export."
        }
      },
      {
        "kind": "security.manifest.source-hygiene",
        "id": "security.manifest.source-hygiene",
        "provenance": {
          "because": "Non-registry dependency sources need explicit human sign-off before they enter the tree (docs/evidence/manifest-security-probe/MANIFEST_PROBE_REPORT.md Rule 1)."
        }
      },
      {
        "kind": "security.manifest.new-dependency",
        "id": "security.manifest.new-dependency",
        "provenance": {
          "because": "A newly added dependency is a genuinely new, externally-sourced surface worth a deliberate look before it merges (docs/evidence/manifest-security-probe/MANIFEST_PROBE_REPORT.md Rule 7 — real historical catch: @anthropic-ai/sdk entering this repo in Stage 4)."
        }
      }
    ]
  }
}
